//BACPATH  JOB MFIDEMO,MFIDEMO,CLASS=A,MSGCLASS=A
//*
//* DELETE path
//*
//STEP2     EXEC PGM=IDCAMS,REGION=512K
//SYSPRINT  DD   SYSOUT=A
//SYSIN     DD   *
         DELETE  -
           MFI01V.MFIDEMO.BNKACC.PATH3 -
           PATH PURGE
//

