//BACPATH  JOB MFIDEMO,MFIDEMO,CLASS=A,MSGCLASS=A
//*
//* Define path
//*
//STEP2     EXEC PGM=IDCAMS,REGION=512K
//SYSPRINT  DD   SYSOUT=A
//SYSIN     DD   *
         DEFINE  PATH -
           (NAME(MFI01V.MFIDEMO.BNKACC.PATH3) -
           PATHENTRY(MFI01V.MFIDEMO.BNKACC.AIX1))
//

