  /****************************************************************
  *
  *  Copyright(C) 1998-2010 Micro Focus. All Rights Reserved.
  *
  ****************************************************************/

  /****************************************************************
  * CBANKVAT.INC
  *---------------------------------------------------------------
  * This is the record file record layout for bank account type
  ****************************************************************/
     05  BAT_RECORD,
       10  BAT_REC_TYPE                        CHAR(1),
       10  BAT_REC_DESC                        CHAR(15),
       10  BAT_REC_FILLER                      CHAR(84);
