  DCL 1 BANK_EVERYTHING_R BASED(ADDR(BANK_EVERYTHING)),
         15  BANK_PREFIX                       CHAR(22),
         15  BANK_CONTROL_FIELDS,
           20  BANK_ENV                        CHAR(4),
              /*  BANK-ENV-NULL                 VALUE LOW-VALUES.
              88  BANK-ENV-CICS                 VALUE 'CICS'.
              88  BANK-ENV-IMS                  VALUE 'IMS '.
              88  BANK-ENV-INET                 VALUE 'INET'*/
           20  BANK_COLOUR_SETTING             CHAR(1),
              /*   COLOUR-ON                     VALUE '1'.
              88   COLOUR-OFF                    VALUE '0'*/
           20  BANK_CONVERSATION               CHAR(1),
              /*  BANK-NO-CONV-IN-PROGRESS      VALUE '0'.
              88  BANK-CONV-IN-PROGRESS         VALUE '1'*/
           20  BANK_TS_QUEUE_NAME              CHAR(8),
           20  BANK_AID                        CHAR(5),
              /*  BANK-AID-ENTER                VALUE 'ENTER'.
              88  BANK-AID-CLEAR                VALUE 'CLEAR'.
              88  BANK-AID-PA1                  VALUE 'PA1  '.
              88  BANK-AID-PA2                  VALUE 'PA2  '.
              88  BANK-AID-PFK01                VALUE 'PFK01'.
              88  BANK-AID-PFK02                VALUE 'PFK02'.
              88  BANK-AID-PFK03                VALUE 'PFK03'.
              88  BANK-AID-PFK04                VALUE 'PFK04'.
              88  BANK-AID-PFK05                VALUE 'PFK05'.
              88  BANK-AID-PFK06                VALUE 'PFK06'.
              88  BANK-AID-PFK07                VALUE 'PFK07'.
              88  BANK-AID-PFK08                VALUE 'PFK08'.
              88  BANK-AID-PFK09                VALUE 'PFK09'.
              88  BANK-AID-PFK10                VALUE 'PFK10'.
              88  BANK-AID-PFK11                VALUE 'PFK11'.
              88  BANK-AID-PFK12                VALUE 'PFK12'*/
           20  BANK_LAST_PROG                  CHAR(8),
           20  BANK_NEXT_PROG                  CHAR(8),
           20  BANK_RETURN_TO_PROG             CHAR(8),
           20  BANK_LAST_MAPSET                CHAR(7),
           20  BANK_LAST_MAP                   CHAR(7),
           20  BANK_NEXT_MAPSET                CHAR(7),
           20  BANK_NEXT_MAP                   CHAR(7),
           20  BANK_MAP_FUNCTION               CHAR(3),
              /*  BANK-MAP-FUNCTION-GET         VALUE 'GET'.
              88  BANK-MAP-FUNCTION-PUT         VALUE 'PUT'*/
           20  BANK_HELP_FIELDS,
             25  BANK_HELP_FLAG                CHAR(4),
                /*  BANK-HELP-ACTIVE            VALUE 'HELP'.
                88  BANK-HELP-INACTIVE          VALUE LOW-VALUES*/
             25  BANK_HELP_SCREEN              PIC'(2)9',
           20  BANK_PAGING_FIELDS,
             25  BANK_PAGING_STATUS            CHAR(1),
                /*  BANK-PAGING-OFF             VALUE LOW-VALUES.
                88  BANK-PAGING-FIRST           VALUE '1'.
                88  BANK-PAGING-MIDDLE          VALUE '2'.
                88  BANK-PAGING-LAST            VALUE '3'*/
             25  BANK_PAGING_FIRST_ENTRY       CHAR(26),
             25  BANK_PAGING_LAST_ENTRY        CHAR(26),
           20  BANK_RETURN_FLAG                CHAR(1),
              /*  BANK-RETURN-FLAG-OFF          VALUE LOW-VALUES.
              88  BANK-RETURN-FLAG-ON           VALUE '1'*/
           20  BANK_RETURN_MSG                 CHAR(75),
              /*  BANK-RETURN-MSG-OFF           VALUE LOW-VALUES*/
         15  BANK_ERROR_MSG                    CHAR(75),
         15  BANK_USER_DETAILS,
           20  BANK_SIGNON_ID                  CHAR(5),
           20  BANK_USERID                     CHAR(5),
              /*  GUEST                         VALUE 'GUEST'*/
           20  BANK_USERID_NAME                CHAR(25),
           20  BANK_PSWD                       CHAR(8),
         15  BANK_HELP_DATA,
           20  BANK_HELP_SCRN                  CHAR(6),
           20  BANK_HELP_STATUS                CHAR(1),
              /* BANK-HELP-FOUND                VALUE 'Y'.
              88 BANK-HELP-NOT-FOUND            VALUE 'N'*/
           20  BANK_HELP_LINE(19)              CHAR(75),

         15  BANK_SCREEN_DATA,
           20  BANK_SCREEN10_DATA,
             25  FILL05                        CHAR(1),
           20  BANK_SCREEN20_DATA,
             25  BANK_SCR20_SEL1ID             CHAR(1),
             25  BANK_SCR20_SEL1IP             CHAR(1),
             25  BANK_SCR20_SEL1TX             CHAR(40),
             25  BANK_SCR20_SEL2ID             CHAR(1),
             25  BANK_SCR20_SEL2IP             CHAR(1),
             25  BANK_SCR20_SEL2TX             CHAR(40),
             25  BANK_SCR20_SEL3ID             CHAR(1),
             25  BANK_SCR20_SEL3IP             CHAR(1),
             25  BANK_SCR20_SEL3TX             CHAR(40),
             25  BANK_SCR20_SEL4ID             CHAR(1),
             25  BANK_SCR20_SEL4IP             CHAR(1),
             25  BANK_SCR20_SEL4TX             CHAR(40),
             25  BANK_SCR20_SEL5ID             CHAR(1),
             25  BANK_SCR20_SEL5IP             CHAR(1),
             25  BANK_SCR20_SEL5TX             CHAR(40),
             25  BANK_SCR20_SEL6ID             CHAR(1),
             25  BANK_SCR20_SEL6IP             CHAR(1),
             25  BANK_SCR20_SEL6TX             CHAR(40),
             25  BANK_SCR20_SEL7ID             CHAR(1),
             25  BANK_SCR20_SEL7IP             CHAR(1),
             25  BANK_SCR20_SEL7TX             CHAR(40),

           20  BANK_SCREEN30_DATA,
             25  BANK_SCR30_DET1               CHAR(1),
             25  BANK_SCR30_ACC1               CHAR(9),
             25  BANK_SCR30_DSC1               CHAR(15),
             25  BANK_SCR30_BAL1               CHAR(13),
             25  BANK_SCR30_SRV1               CHAR(6),
             25  BANK_SCR30_DTE1               CHAR(11),
             25  BANK_SCR30_TXN1               CHAR(1),
             25  BANK_SCR30_DET2               CHAR(1),
             25  BANK_SCR30_ACC2               CHAR(9),
             25  BANK_SCR30_DSC2               CHAR(15),
             25  BANK_SCR30_BAL2               CHAR(13),
             25  BANK_SCR30_SRV2               CHAR(6),
             25  BANK_SCR30_DTE2               CHAR(11),
             25  BANK_SCR30_TXN2               CHAR(1),
             25  BANK_SCR30_DET3               CHAR(1),
             25  BANK_SCR30_ACC3               CHAR(9),
             25  BANK_SCR30_DSC3               CHAR(15),
             25  BANK_SCR30_BAL3               CHAR(13),
             25  BANK_SCR30_SRV3               CHAR(6),
             25  BANK_SCR30_DTE3               CHAR(11),
             25  BANK_SCR30_TXN3               CHAR(1),
             25  BANK_SCR30_DET4               CHAR(1),
             25  BANK_SCR30_ACC4               CHAR(9),
             25  BANK_SCR30_DSC4               CHAR(15),
             25  BANK_SCR30_BAL4               CHAR(13),
             25  BANK_SCR30_SRV4               CHAR(6),
             25  BANK_SCR30_DTE4               CHAR(11),
             25  BANK_SCR30_TXN4               CHAR(1),
             25  BANK_SCR30_DET5               CHAR(1),
             25  BANK_SCR30_ACC5               CHAR(9),
             25  BANK_SCR30_DSC5               CHAR(15),
             25  BANK_SCR30_BAL5               CHAR(13),
             25  BANK_SCR30_SRV5               CHAR(6),
             25  BANK_SCR30_DTE5               CHAR(11),
             25  BANK_SCR30_TXN5               CHAR(1),
             25  BANK_SCR30_DET6               CHAR(1),
             25  BANK_SCR30_ACC6               CHAR(9),
             25  BANK_SCR30_DSC6               CHAR(15),
             25  BANK_SCR30_BAL6               CHAR(13),
             25  BANK_SCR30_SRV6               CHAR(6),
             25  BANK_SCR30_DTE6               CHAR(11),
             25  BANK_SCR30_TXN6               CHAR(1),
             25  BANK_SCR30_SRVMSG             CHAR(62),

           20  BANK_SCREEN35_DATA,
             25  BANK_SCR35_ACC                CHAR(9),
             25  BANK_SCR35_DSC                CHAR(15),
             25  BANK_SCR35_BAL                CHAR(13),
             25  BANK_SCR35_DTE                CHAR(11),
             25  BANK_SCR35_TRANS              CHAR(5),
             25  BANK_SCR35_ATM_FIELDS,
               30  BANK_SCR35_ATM_ENABLED      CHAR(1),
               30  BANK_SCR35_ATM_LIM          CHAR(3),
               30  BANK_SCR35_ATM_LDTE         CHAR(11),
               30  BANK_SCR35_ATM_LAMT         CHAR(3),
             25  BANK_SCR35_RP_FIELDS,
               30  BANK_SCR35_RP1_FIELDS,
                 35  BANK_SCR35_RP1DAY         CHAR(2),
                 35  BANK_SCR35_RP1AMT         CHAR(10),
                 35  BANK_SCR35_RP1PID         CHAR(5),
                 35  BANK_SCR35_RP1ACC         CHAR(9),
                 35  BANK_SCR35_RP1DTE         CHAR(11),
               30  BANK_SCR35_RP2_FIELDS,
                 35  BANK_SCR35_RP2DAY         CHAR(2),
                 35  BANK_SCR35_RP2AMT         CHAR(10),
                 35  BANK_SCR35_RP2PID         CHAR(5),
                 35  BANK_SCR35_RP2ACC         CHAR(9),
                 35  BANK_SCR35_RP2DTE         CHAR(11),
               30  BANK_SCR35_RP3_FIELDS,
                 35  BANK_SCR35_RP3DAY         CHAR(2),
                 35  BANK_SCR35_RP3AMT         CHAR(10),
                 35  BANK_SCR35_RP3PID         CHAR(5),
                 35  BANK_SCR35_RP3ACC         CHAR(9),
                 35  BANK_SCR35_RP3DTE         CHAR(11),
           20  BANK_SCREEN40_DATA,
             25  BANK_SCR40_ACC                CHAR(9),
             25  BANK_SCR40_ACCTYPE            CHAR(15),
             25  BANK_SCR40_TXN_FIELDS,
               30  BANK_SCR40_DAT1             CHAR(11),
               30  BANK_SCR40_TIM1             CHAR(8),
               30  BANK_SCR40_AMT1             CHAR(13),
               30  BANK_SCR40_DSC1             CHAR(30),
               30  BANK_SCR40_DAT2             CHAR(11),
               30  BANK_SCR40_TIM2             CHAR(8),
               30  BANK_SCR40_AMT2             CHAR(13),
               30  BANK_SCR40_DSC2             CHAR(30),
               30  BANK_SCR40_DAT3             CHAR(11),
               30  BANK_SCR40_TIM3             CHAR(8),
               30  BANK_SCR40_AMT3             CHAR(13),
               30  BANK_SCR40_DSC3             CHAR(30),
               30  BANK_SCR40_DAT4             CHAR(11),
               30  BANK_SCR40_TIM4             CHAR(8),
               30  BANK_SCR40_AMT4             CHAR(13),
               30  BANK_SCR40_DSC4             CHAR(30),
               30  BANK_SCR40_DAT5             CHAR(11),
               30  BANK_SCR40_TIM5             CHAR(8),
               30  BANK_SCR40_AMT5             CHAR(13),
               30  BANK_SCR40_DSC5             CHAR(30),
               30  BANK_SCR40_DAT6             CHAR(11),
               30  BANK_SCR40_TIM6             CHAR(8),
               30  BANK_SCR40_AMT6             CHAR(13),
               30  BANK_SCR40_DSC6             CHAR(30),
               30  BANK_SCR40_DAT7             CHAR(11),
               30  BANK_SCR40_TIM7             CHAR(8),
               30  BANK_SCR40_AMT7             CHAR(13),
               30  BANK_SCR40_DSC7             CHAR(30),
               30  BANK_SCR40_DAT8             CHAR(11),
               30  BANK_SCR40_TIM8             CHAR(8),
               30  BANK_SCR40_AMT8             CHAR(13),
               30  BANK_SCR40_DSC8             CHAR(30),

           20  BANK_SCREEN50_DATA,
             25  BANK_SCR50_XFER               CHAR(8),
             25  BANK_SCR50_FRM1               CHAR(1),
             25  BANK_SCR50_TO1                CHAR(1),
             25  BANK_SCR50_ACC1               CHAR(9),
             25  BANK_SCR50_DSC1               CHAR(15),
             25  BANK_SCR50_BAL1               CHAR(13),
             25  BANK_SCR50_FRM2               CHAR(1),
             25  BANK_SCR50_TO2                CHAR(1),
             25  BANK_SCR50_ACC2               CHAR(9),
             25  BANK_SCR50_DSC2               CHAR(15),
             25  BANK_SCR50_BAL2               CHAR(13),
             25  BANK_SCR50_FRM3               CHAR(1),
             25  BANK_SCR50_TO3                CHAR(1),
             25  BANK_SCR50_ACC3               CHAR(9),
             25  BANK_SCR50_DSC3               CHAR(15),
             25  BANK_SCR50_BAL3               CHAR(13),
             25  BANK_SCR50_FRM4               CHAR(1),
             25  BANK_SCR50_TO4                CHAR(1),
             25  BANK_SCR50_ACC4               CHAR(9),
             25  BANK_SCR50_DSC4               CHAR(15),
             25  BANK_SCR50_BAL4               CHAR(13),
             25  BANK_SCR50_FRM5               CHAR(1),
             25  BANK_SCR50_TO5                CHAR(1),
             25  BANK_SCR50_ACC5               CHAR(9),
             25  BANK_SCR50_DSC5               CHAR(15),
             25  BANK_SCR50_BAL5               CHAR(13),
             25  BANK_SCR50_FRM6               CHAR(1),
             25  BANK_SCR50_TO6                CHAR(1),
             25  BANK_SCR50_ACC6               CHAR(9),
             25  BANK_SCR50_DSC6               CHAR(15),
             25  BANK_SCR50_BAL6               CHAR(13),
             25  BANK_SCR50_ERRMSG             CHAR(62),

           20  BANK_SCREEN60_DATA,
             25  BANK_SCR60_RETURN_TO          CHAR(8),
             25  BANK_SCR60_CONTACT_ID         CHAR(5),
             25  BANK_SCR60_CONTACT_NAME       CHAR(25),
             25  BANK_SCR60_CHANGE_ACTION      CHAR(1),
                /*  ADDR-CHANGE-REQUEST         VALUE ' '.
                88  ADDR-CHANGE-VERIFY          VALUE 'V'.
                88  ADDR-CHANGE-COMMIT          VALUE 'U'*/
             25  BANK_SCR60_OLD_DETS,
               30  BANK_SCR60_OLD_ADDR1        CHAR(25),
               30  BANK_SCR60_OLD_ADDR2        CHAR(25),
               30  BANK_SCR60_OLD_STATE        CHAR(2),
               30  BANK_SCR60_OLD_CNTRY        CHAR(6),
               30  BANK_SCR60_OLD_PSTCDE       CHAR(6),
               30  BANK_SCR60_OLD_TELNO        CHAR(12),
               30  BANK_SCR60_OLD_EMAIL        CHAR(30),
               30  BANK_SCR60_OLD_SEND_MAIL    CHAR(1),
               30  BANK_SCR60_OLD_SEND_EMAIL   CHAR(1),
             25  BANK_SCR60_NEW_DETS,
               30  BANK_SCR60_NEW_ADDR1        CHAR(25),
               30  BANK_SCR60_NEW_ADDR2        CHAR(25),
               30  BANK_SCR60_NEW_STATE        CHAR(2),
               30  BANK_SCR60_NEW_CNTRY        CHAR(6),
               30  BANK_SCR60_NEW_PSTCDE       CHAR(6),
               30  BANK_SCR60_NEW_TELNO        CHAR(12),
               30  BANK_SCR60_NEW_EMAIL        CHAR(30),
               30  BANK_SCR60_NEW_SEND_MAIL    CHAR(1),
               30  BANK_SCR60_NEW_SEND_EMAIL   CHAR(1),

           20  BANK_SCREEN70_DATA,
             25  BANK_SCR70_AMOUNT             CHAR(7),
             25  BANK_SCR70_RATE               CHAR(7),
             25  BANK_SCR70_TERM               CHAR(5),
             25  BANK_SCR70_PAYMENT            CHAR(9),

           20  BANK_SCREEN80_DATA,
             25  BANK_SCR80_CONTACT_ID         CHAR(5),
             25  BANK_SCR80_CONTACT_NAME       CHAR(25),
             25  BANK_SCR80_PRINT_ACTION       CHAR(1),
                /*  PRINT-REQUEST               VALUE ' '.
                88  PRINT-CONFIRM               VALUE 'C'*/
             25  BANK_SCR80_DETS,
               30  BANK_SCR80_ADDR1            CHAR(25),
               30  BANK_SCR80_ADDR2            CHAR(25),
               30  BANK_SCR80_STATE            CHAR(2),
               30  BANK_SCR80_CNTRY            CHAR(6),
               30  BANK_SCR80_PSTCDE           CHAR(6),
               30  BANK_SCR80_EMAIL            CHAR(30),
               30  BANK_SCR80_OPT1             CHAR(1),
               30  BANK_SCR80_OPT2             CHAR(1),

            20  BANK_SCREEN90_DATA,
             25  BANK_SCR90_SCRN               CHAR(6),
             25  BANK_SCR90_SCRN_STATUS        CHAR(1),
             25 BANK_SCR90_LINE(19)            CHAR(75),

           20  BANK_SCREENZZ_DATA,
             25  BANK_SCRZZ_SEL1ID             CHAR(1),
             25  BANK_SCRZZ_SEL1IP             CHAR(1),
             25  BANK_SCRZZ_SEL1TX             CHAR(40),
             25  BANK_SCRZZ_SEL2ID             CHAR(1),
             25  BANK_SCRZZ_SEL2IP             CHAR(1),
             25  BANK_SCRZZ_SEL2TX             CHAR(40),
             25  BANK_SCRZZ_SEL3ID             CHAR(1),
             25  BANK_SCRZZ_SEL3IP             CHAR(1),
             25  BANK_SCRZZ_SEL3TX             CHAR(40),
             25  BANK_SCRZZ_SEL4ID             CHAR(1),
             25  BANK_SCRZZ_SEL4IP             CHAR(1),
             25  BANK_SCRZZ_SEL4TX             CHAR(40),
             25  BANK_SCRZZ_SEL5ID             CHAR(1),
             25  BANK_SCRZZ_SEL5IP             CHAR(1),
             25  BANK_SCRZZ_SEL5TX             CHAR(40),
             25  BANK_SCRZZ_SEL6ID             CHAR(1),
             25  BANK_SCRZZ_SEL6IP             CHAR(1),
             25  BANK_SCRZZ_SEL6TX             CHAR(40),
             25  BANK_SCRZZ_SEL7ID             CHAR(1),
             25  BANK_SCRZZ_SEL7IP             CHAR(1),
             25  BANK_SCRZZ_SEL7TX             CHAR(40),
             25  BANK_SCRZZ_SEL8ID             CHAR(1),
             25  BANK_SCRZZ_SEL8IP             CHAR(1),
             25  BANK_SCRZZ_SEL8TX             CHAR(40);

 /*
    Misc redefinitions
 */
  DCL 1 BANK_IMS_PREFIX BASED(ADDR(BANK_PREFIX)),
           20  BANK_IMS_SPA_LL                 FIXED BIN(31),
           20  BANK_IMS_SPA_ZZ                 CHAR(2),
           20  BANK_IMS_SPA_TRANCODE           CHAR(8),
           20  BANK_IMS_SPA_PASSED_DATA        CHAR(8);
  DCL 1 BANK_IMS_SPA_PASSED_DATA_R1
        BASED(ADDR(BANK_IMS_SPA_PASSED_DATA)),
             25  BANK_IMS_IO_PCB_DATE          FIXED DEC(7),
             25  BANK_IMS_IO_PCB_TIME          FIXED DEC(7);
  DCL 1 BANK_IMS_SPA_PASSED_DATA_R2
        BASED(ADDR(BANK_IMS_SPA_PASSED_DATA)),
             25  BANK_IMS_SPA_PASSED_LITERAL   CHAR(7),
             25  BANK_IMS_SPA_PASSED_COLOUR    CHAR(1);
  DCL 1 BANK_CICS_PREFIX BASED(ADDR(BANK_PREFIX)),
           20  BANK_CICS_LL                    FIXED BIN(15),
           20  FILL01                          CHAR(4),
           20  BANK_CICS_TRANCODE_PLUS4,
             25  BANK_CICS_TRANCODE            CHAR(4),
             25  FILL03                        CHAR(4);
  DCL 1 FILL04 BASED(ADDR(BANK_SIGNON_ID)),
             25  BANK_SIGNON_ID_1              CHAR(1),
                /*  PROBLEM-USER                VALUE 'Z'*/
             25  BANK_SIGNON_ID_2_5            CHAR(4);
  DCL 1 BANK_SCREEN20_DATA_R BASED(ADDR(BANK_SCREEN20_DATA)),
             25  BANK_SCREEN20_FIELD(7),
               30  BANK_SCR20_ID               CHAR(1),
               30  BANK_SCR20_IP               CHAR(1),
               30  BANK_SCR20_TX               CHAR(40);
  DCL 1 BANK_SCREEN30_DATA_R BASED(ADDR(BANK_SCREEN30_DATA)),
             25  BANK_SCREEN30_INPUT_DATA,
               30  BANK_SCREEN30_INPUT(6),
                 35  BANK_SCR30_DET            CHAR(1),
                 35  BANK_SCR30_ACC            CHAR(9),
                 35  BANK_SCR30_DSC            CHAR(15),
                 35  BANK_SCR30_BAL            CHAR(13),
                 35  BANK_SCR30_SRV            CHAR(6),
                 35  BANK_SCR30_DTE            CHAR(11),
                 35  BANK_SCR30_TXN            CHAR(1);
                    /*  BANK-SCR30-TXN-PRESENT  VALUE '*'*/
  DCL 1 BANK_SCREEN40_DATA_R BASED(ADDR(BANK_SCREEN40_DATA)),
             25  BANK_SCR40_ACC_R              CHAR(9),
             25  BANK_SCR40_ACCTYPE_R          CHAR(15),
             25  BANK_SCREEN40_TXNS(8),
               30  BANK_SCR40_DATE             CHAR(11),
               30  BANK_SCR40_TIME             CHAR(8),
               30  BANK_SCR40_AMNT             CHAR(13),
               30  BANK_SCR40_DESC             CHAR(30);
  DCL 1 BANK_SCREENZZ_DATA_R BASED(ADDR(BANK_SCREENZZ_DATA)),
             25  BANK_SCREENZZ_FIELD(8),
               30  BANK_SCRZZ_ID               CHAR(1),
               30  BANK_SCRZZ_IP               CHAR(1),
               30  BANK_SCRZZ_TX               CHAR(40);
