 /****************************************************************
 *
 *  Copyright(C) 1998-2010 Micro Focus. All Rights Reserved.
 *
 ****************************************************************/

 /****************************************************************
 * CBANKEXT.INC
 *---------------------------------------------------------------
 ****************************************************************/
     10 EXT_DATA                            CHAR(1024);
 /*
    Misc redefinitions
 */
 DCL 1 EXT_IP_DATA BASED(ADDR(EXT_DATA)),
        15  EXT_IP_AID                        CHAR(5),
        15  EXT_IP_AREA                       CHAR(256);
 DCL 1 EXT_IP00_DATA BASED(ADDR(EXT_IP_AREA)),
          20  EXT_IP00_SEL                    CHAR(1);
 DCL 1 EXT_IP10_DATA BASED(ADDR(EXT_IP_AREA)),
          20  EXT_IP10_USERID                 CHAR(5),
          20  EXT_IP10_PSWD                   CHAR(8);
 DCL 1 EXT_IP20_DATA BASED(ADDR(EXT_IP_AREA)),
          20  EXT_IP20_SEL1ID                 CHAR(1),
          20  EXT_IP20_SEL1IP                 CHAR(1),
          20  EXT_IP20_SEL2ID                 CHAR(1),
          20  EXT_IP20_SEL2IP                 CHAR(1),
          20  EXT_IP20_SEL3ID                 CHAR(1),
          20  EXT_IP20_SEL3IP                 CHAR(1),
          20  EXT_IP20_SEL4ID                 CHAR(1),
          20  EXT_IP20_SEL4IP                 CHAR(1),
          20  EXT_IP20_SEL5ID                 CHAR(1),
          20  EXT_IP20_SEL5IP                 CHAR(1),
          20  EXT_IP20_SEL6ID                 CHAR(1),
          20  EXT_IP20_SEL6IP                 CHAR(1),
          20  EXT_IP20_SEL7ID                 CHAR(1),
          20  EXT_IP20_SEL7IP                 CHAR(1);
 DCL 1 EXT_IP30_DATA BASED(ADDR(EXT_IP_AREA)),
          20  EXT_IP30_DET1                   CHAR(1),
          20  EXT_IP30_DET2                   CHAR(1),
          20  EXT_IP30_DET3                   CHAR(1),
          20  EXT_IP30_DET4                   CHAR(1),
          20  EXT_IP30_DET5                   CHAR(1),
          20  EXT_IP30_DET6                   CHAR(1);
 DCL 1 EXT_IP35_DATA BASED(ADDR(EXT_IP_AREA)),
          20  EXT_IP35_DUMMY                  CHAR(1);
 DCL 1 EXT_IP40_DATA BASED(ADDR(EXT_IP_AREA)),
          20  EXT_IP40_DUMMY                  CHAR(1);
 DCL 1 EXT_IP50_DATA BASED(ADDR(EXT_IP_AREA)),
          20  EXT_IP50_XFER                   CHAR(8),
          20  EXT_IP50_FRM1                   CHAR(1),
          20  EXT_IP50_TO1                    CHAR(1),
          20  EXT_IP50_FRM2                   CHAR(1),
          20  EXT_IP50_TO2                    CHAR(1),
          20  EXT_IP50_FRM3                   CHAR(1),
          20  EXT_IP50_TO3                    CHAR(1),
          20  EXT_IP50_FRM4                   CHAR(1),
          20  EXT_IP50_TO4                    CHAR(1),
          20  EXT_IP50_FRM5                   CHAR(1),
          20  EXT_IP50_TO5                    CHAR(1),
          20  EXT_IP50_FRM6                   CHAR(1),
          20  EXT_IP50_TO6                    CHAR(1);
 DCL 1 EXT_IP60_DATA BASED(ADDR(EXT_IP_AREA)),
          20  EXT_IP60_NADDR1                 CHAR(25),
          20  EXT_IP60_NADDR2                 CHAR(25),
          20  EXT_IP60_NSTATE                 CHAR(2),
          20  EXT_IP60_NCNTRY                 CHAR(6),
          20  EXT_IP60_NPSTCDE                CHAR(6),
          20  EXT_IP60_NTELNO                 CHAR(12),
          20  EXT_IP60_NEMAIL                 CHAR(30),
          20  EXT_IP60_NSMAIL                 CHAR(1),
          20  EXT_IP60_NSEMAIL                CHAR(1);
 DCL 1 EXT_IP70_DATA BASED(ADDR(EXT_IP_AREA)),
          20  EXT_IP70_AMOUNT                 CHAR(7),
          20  EXT_IP70_RATE                   CHAR(5),
          20  EXT_IP70_TERM                   CHAR(5);
 DCL 1 EXT_IP80_DATA BASED(ADDR(EXT_IP_AREA)),
          20  EXT_IP80_OPT1                   CHAR(1),
          20  EXT_IP80_OPT2                   CHAR(1);
 DCL 1 EXT_IPZZ_DATA BASED(ADDR(EXT_IP_AREA)),
          20  EXT_IPZZ_SEL1ID                 CHAR(1),
          20  EXT_IPZZ_SEL1IP                 CHAR(1),
          20  EXT_IPZZ_SEL2ID                 CHAR(1),
          20  EXT_IPZZ_SEL2IP                 CHAR(1),
          20  EXT_IPZZ_SEL3ID                 CHAR(1),
          20  EXT_IPZZ_SEL3IP                 CHAR(1),
          20  EXT_IPZZ_SEL4ID                 CHAR(1),
          20  EXT_IPZZ_SEL4IP                 CHAR(1),
          20  EXT_IPZZ_SEL5ID                 CHAR(1),
          20  EXT_IPZZ_SEL5IP                 CHAR(1),
          20  EXT_IPZZ_SEL6ID                 CHAR(1),
          20  EXT_IPZZ_SEL6IP                 CHAR(1),
          20  EXT_IPZZ_SEL7ID                 CHAR(1),
          20  EXT_IPZZ_SEL7IP                 CHAR(1),
          20  EXT_IPZZ_SEL8ID                 CHAR(1),
          20  EXT_IPZZ_SEL8IP                 CHAR(1);

 DCL 1 EXT_OP_AREA BASED(ADDR(EXT_DATA)),
             15  EXT_OP_TRAN                       CHAR(4),
             15  EXT_OP_SCREEN                     CHAR(8),
             15  EXT_OP_DATE                       CHAR(11),
             15  EXT_OP_TIME                       CHAR(8),
             15  EXT_OP_HEAD1                      CHAR(50),
             15  EXT_OP_HEAD2                      CHAR(50),
             15  EXT_OP_VERSION                    CHAR(7),
             15  EXT_OP_ERR_MSG                    CHAR(75),
             15  EXT_OP_USERID                     CHAR(5),
             15  EXT_OP_NAME                       CHAR(25),
             15  EXT_OP_AREA                       CHAR(768);
 DCL 1 EXT_OP00_DATA BASED(ADDR(EXT_OP_AREA)),
               20  EXT_OP00_TEXT                   CHAR(8);
 DCL 1 EXT_OP10_DATA BASED(ADDR(EXT_OP_AREA)),
               20  EXT_OP10_PSWD                   CHAR(8);
 DCL 1 EXT_OP15_DATA BASED(ADDR(EXT_OP_AREA)),
               20  EXT_OP10_NAME                   CHAR(25);
 DCL 1 EXT_OP20_DATA BASED(ADDR(EXT_OP_AREA)),
               20  EXT_OP20_SEL1ID                 CHAR(1),
               20  EXT_OP20_SEL1IP                 CHAR(1),
               20  EXT_OP20_SEL1TX                 CHAR(40),
               20  EXT_OP20_SEL2ID                 CHAR(1),
               20  EXT_OP20_SEL2IP                 CHAR(1),
               20  EXT_OP20_SEL2TX                 CHAR(40),
               20  EXT_OP20_SEL3ID                 CHAR(1),
               20  EXT_OP20_SEL3IP                 CHAR(1),
               20  EXT_OP20_SEL3TX                 CHAR(40),
               20  EXT_OP20_SEL4ID                 CHAR(1),
               20  EXT_OP20_SEL4IP                 CHAR(1),
               20  EXT_OP20_SEL4TX                 CHAR(40),
               20  EXT_OP20_SEL5ID                 CHAR(1),
               20  EXT_OP20_SEL5IP                 CHAR(1),
               20  EXT_OP20_SEL5TX                 CHAR(40),
               20  EXT_OP20_SEL6ID                 CHAR(1),
               20  EXT_OP20_SEL6IP                 CHAR(1),
               20  EXT_OP20_SEL6TX                 CHAR(40),
               20  EXT_OP20_SEL7ID                 CHAR(1),
               20  EXT_OP20_SEL7IP                 CHAR(1),
               20  EXT_OP20_SEL7TX                 CHAR(40);
 DCL 1 EXT_OP30_DATA BASED(ADDR(EXT_OP_AREA)),
               20  EXT_OP30_DET1                   CHAR(9),
               20  EXT_OP30_ACC1                   CHAR(9),
               20  EXT_OP30_DSC1                   CHAR(15),
               20  EXT_OP30_BAL1                   CHAR(13),
               20  EXT_OP30_SRV1                   CHAR(6),
               20  EXT_OP30_DTE1                   CHAR(11),
               20  EXT_OP30_TXN1                   CHAR(1),
               20  EXT_OP30_TXS1                   CHAR(1),
               20  EXT_OP30_DET2                   CHAR(9),
               20  EXT_OP30_ACC2                   CHAR(9),
               20  EXT_OP30_DSC2                   CHAR(15),
               20  EXT_OP30_BAL2                   CHAR(13),
               20  EXT_OP30_SRV2                   CHAR(6),
               20  EXT_OP30_DTE2                   CHAR(11),
               20  EXT_OP30_TXN2                   CHAR(1),
               20  EXT_OP30_TXS2                   CHAR(1),
               20  EXT_OP30_DET3                   CHAR(9),
               20  EXT_OP30_ACC3                   CHAR(9),
               20  EXT_OP30_DSC3                   CHAR(15),
               20  EXT_OP30_BAL3                   CHAR(13),
               20  EXT_OP30_SRV3                   CHAR(6),
               20  EXT_OP30_DTE3                   CHAR(11),
               20  EXT_OP30_TXN3                   CHAR(1),
               20  EXT_OP30_TXS3                   CHAR(1),
               20  EXT_OP30_DET4                   CHAR(9),
               20  EXT_OP30_ACC4                   CHAR(9),
               20  EXT_OP30_DSC4                   CHAR(15),
               20  EXT_OP30_BAL4                   CHAR(13),
               20  EXT_OP30_SRV4                   CHAR(6),
               20  EXT_OP30_DTE4                   CHAR(11),
               20  EXT_OP30_TXN4                   CHAR(1),
               20  EXT_OP30_TXS4                   CHAR(1),
               20  EXT_OP30_DET5                   CHAR(9),
               20  EXT_OP30_ACC5                   CHAR(9),
               20  EXT_OP30_DSC5                   CHAR(15),
               20  EXT_OP30_BAL5                   CHAR(13),
               20  EXT_OP30_SRV5                   CHAR(6),
               20  EXT_OP30_DTE5                   CHAR(11),
               20  EXT_OP30_TXN5                   CHAR(1),
               20  EXT_OP30_TXS5                   CHAR(1),
               20  EXT_OP30_DET6                   CHAR(9),
               20  EXT_OP30_ACC6                   CHAR(9),
               20  EXT_OP30_DSC6                   CHAR(15),
               20  EXT_OP30_BAL6                   CHAR(13),
               20  EXT_OP30_SRV6                   CHAR(6),
               20  EXT_OP30_DTE6                   CHAR(11),
               20  EXT_OP30_TXN6                   CHAR(1),
               20  EXT_OP30_TXS6                   CHAR(1);
 DCL 1 EXT_OP35_DATA BASED(ADDR(EXT_OP_AREA)),
               20  EXT_OP35_ACCNO                  CHAR(9),
               20  EXT_OP35_ACCTYPE                CHAR(15),
               20  EXT_OP35_BALANCE                CHAR(13),
               20  EXT_OP35_STMT_DATE              CHAR(11),
               20  EXT_OP35_ATM_DETAILS,
                 25  EXT_OP35_ATM_VIS              CHAR(1),
                 25  EXT_OP35_ATM_LIM              CHAR(3),
                 25  EXT_OP35_ATM_LDTE             CHAR(11),
                 25  EXT_OP35_ATM_LAMT             CHAR(3),
               20  EXT_OP35_RP_DETAILS(3),
                 25  EXT_OP35_RP_DAY               CHAR(2),
                 25  EXT_OP35_RP_AMT               CHAR(8),
                 25  EXT_OP35_RP_PID               CHAR(5),
                 25  EXT_OP35_RP_ACC               CHAR(9),
                 25  EXT_OP35_RP_DTE               CHAR(11);
 DCL 1 EXT_OP40_DATA BASED(ADDR(EXT_OP_AREA)),
               20  EXT_OP40_ACCNO                  CHAR(9),
               20  EXT_OP40_ACCTYPE                CHAR(25),
               20  EXT_OP40_PAGING_STATUS          CHAR(1),
                 /*  EXT_OP40_PAGING_OFF           VALUE LOW_VALUES.
                 88  EXT_OP40_PAGING_FIRST         VALUE '1'.
                 88  EXT_OP40_PAGING_MIDDLE        VALUE '2'.
                 88  EXT_OP40_PAGING_LAST          VALUE '3'*/
               20  EXT_OP40_DETAILS(8),
                 25  EXT_OP40_DATE                 CHAR(11),
                 25  EXT_OP40_TIME                 CHAR(8),
                 25  EXT_OP40_AMNT                 CHAR(13),
                 25  EXT_OP40_DESC                 CHAR(25);
 DCL 1 EXT_OP50_DATA BASED(ADDR(EXT_OP_AREA)),
               20  EXT_OP50_XFER                   CHAR(9),
               20  EXT_OP50_FRM1                   CHAR(1),
               20  EXT_OP50_TO1                    CHAR(1),
               20  EXT_OP50_ACC1                   CHAR(9),
               20  EXT_OP50_DSC1                   CHAR(15),
               20  EXT_OP50_BAL1                   CHAR(13),
               20  EXT_OP50_FRM2                   CHAR(1),
               20  EXT_OP50_TO2                    CHAR(1),
               20  EXT_OP50_ACC2                   CHAR(9),
               20  EXT_OP50_DSC2                   CHAR(15),
               20  EXT_OP50_BAL2                   CHAR(13),
               20  EXT_OP50_FRM3                   CHAR(1),
               20  EXT_OP50_TO3                    CHAR(1),
               20  EXT_OP50_ACC3                   CHAR(9),
               20  EXT_OP50_DSC3                   CHAR(15),
               20  EXT_OP50_BAL3                   CHAR(13),
               20  EXT_OP50_FRM4                   CHAR(1),
               20  EXT_OP50_TO4                    CHAR(1),
               20  EXT_OP50_ACC4                   CHAR(9),
               20  EXT_OP50_DSC4                   CHAR(15),
               20  EXT_OP50_BAL4                   CHAR(13),
               20  EXT_OP50_FRM5                   CHAR(1),
               20  EXT_OP50_TO5                    CHAR(1),
               20  EXT_OP50_ACC5                   CHAR(9),
               20  EXT_OP50_DSC5                   CHAR(15),
               20  EXT_OP50_BAL5                   CHAR(13),
               20  EXT_OP50_FRM6                   CHAR(1),
               20  EXT_OP50_TO6                    CHAR(1),
               20  EXT_OP50_ACC6                   CHAR(9),
               20  EXT_OP50_DSC6                   CHAR(15),
               20  EXT_OP50_BAL6                   CHAR(13);
 DCL 1 EXT_OP60_DATA BASED(ADDR(EXT_OP_AREA)),
               20  EXT_OP60_OADDR1                 CHAR(25),
               20  EXT_OP60_OADDR2                 CHAR(25),
               20  EXT_OP60_OSTATE                 CHAR(2),
               20  EXT_OP60_OCNTRY                 CHAR(6),
               20  EXT_OP60_OPSTCDE                CHAR(6),
               20  EXT_OP60_OTELNO                 CHAR(12),
               20  EXT_OP60_NADDR1                 CHAR(25),
               20  EXT_OP60_NADDR2                 CHAR(25),
               20  EXT_OP60_NSTATE                 CHAR(2),
               20  EXT_OP60_NCNTRY                 CHAR(6),
               20  EXT_OP60_NPSTCDE                CHAR(6),
               20  EXT_OP60_NTELNO                 CHAR(12),
               20  EXT_OP60_NEMAIL                 CHAR(30),
               20  EXT_OP60_NSMAIL                 CHAR(1),
               20  EXT_OP60_NSEMAIL                CHAR(1);
 DCL 1 EXT_OP70_DATA BASED(ADDR(EXT_OP_AREA)),
               20  EXT_OP70_AMOUNT                 CHAR(7),
               20  EXT_OP70_RATE                   CHAR(7),
               20  EXT_OP70_TERM                   CHAR(5),
               20  EXT_OP70_PAYMENT                CHAR(9);
 DCL 1 EXT_OP80_DATA BASED(ADDR(EXT_OP_AREA)),
               20  EXT_OP80_ADDR1                 CHAR(25),
               20  EXT_OP80_ADDR2                 CHAR(25),
               20  EXT_OP80_STATE                 CHAR(2),
               20  EXT_OP80_CNTRY                 CHAR(6),
               20  EXT_OP80_PSTCDE                CHAR(6),
               20  EXT_OP80_EMAIL                 CHAR(30),
               20  EXT_OP80_OPT1                  CHAR(1),
               20  EXT_OP80_OPT2                  CHAR(1);
 DCL 1 EXT_OPZZ_DATA BASED(ADDR(EXT_OP_AREA)),
               20  EXT_OPZZ_SEL1ID                 CHAR(1),
               20  EXT_OPZZ_SEL1IP                 CHAR(1),
               20  EXT_OPZZ_SEL1TX                 CHAR(40),
               20  EXT_OPZZ_SEL2ID                 CHAR(1),
               20  EXT_OPZZ_SEL2IP                 CHAR(1),
               20  EXT_OPZZ_SEL2TX                 CHAR(40),
               20  EXT_OPZZ_SEL3ID                 CHAR(1),
               20  EXT_OPZZ_SEL3IP                 CHAR(1),
               20  EXT_OPZZ_SEL3TX                 CHAR(40),
               20  EXT_OPZZ_SEL4ID                 CHAR(1),
               20  EXT_OPZZ_SEL4IP                 CHAR(1),
               20  EXT_OPZZ_SEL4TX                 CHAR(40),
               20  EXT_OPZZ_SEL5ID                 CHAR(1),
               20  EXT_OPZZ_SEL5IP                 CHAR(1),
               20  EXT_OPZZ_SEL5TX                 CHAR(40),
               20  EXT_OPZZ_SEL6ID                 CHAR(1),
               20  EXT_OPZZ_SEL6IP                 CHAR(1),
               20  EXT_OPZZ_SEL6TX                 CHAR(40),
               20  EXT_OPZZ_SEL7ID                 CHAR(1),
               20  EXT_OPZZ_SEL7IP                 CHAR(1),
               20  EXT_OPZZ_SEL7TX                 CHAR(40),
               20  EXT_OPZZ_SEL8ID                 CHAR(1),
               20  EXT_OPZZ_SEL8IP                 CHAR(1),
               20  EXT_OPZZ_SEL8TX                 CHAR(40);

