     DECLARE 1 BANK10AI BASED(MAPAREA) UNALIGNED,
          2  DFHMS1 CHARACTER (12),
          2  TXT01L    FIXED BINARY (15,0),
          2  TXT01F    CHARACTER (1),
          2  DFHMS2 CHARACTER (4),
          2  TXT01I  CHARACTER (5),
          2  SCRNL    FIXED BINARY (15,0),
          2  SCRNF    CHARACTER (1),
          2  DFHMS3 CHARACTER (4),
          2  SCRNI  CHARACTER (6),
          2  HEAD1L    FIXED BINARY (15,0),
          2  HEAD1F    CHARACTER (1),
          2  DFHMS4 CHARACTER (4),
          2  HEAD1I  CHARACTER (50),
          2  DATEL    FIXED BINARY (15,0),
          2  DATEF    CHARACTER (1),
          2  DFHMS5 CHARACTER (4),
          2  DATEI  CHARACTER (11),
          2  TXT02L    FIXED BINARY (15,0),
          2  TXT02F    CHARACTER (1),
          2  DFHMS6 CHARACTER (4),
          2  TXT02I  CHARACTER (5),
          2  TRANL    FIXED BINARY (15,0),
          2  TRANF    CHARACTER (1),
          2  DFHMS7 CHARACTER (4),
          2  TRANI  CHARACTER (4),
          2  HEAD2L    FIXED BINARY (15,0),
          2  HEAD2F    CHARACTER (1),
          2  DFHMS8 CHARACTER (4),
          2  HEAD2I  CHARACTER (50),
          2  TIMEL    FIXED BINARY (15,0),
          2  TIMEF    CHARACTER (1),
          2  DFHMS9 CHARACTER (4),
          2  TIMEI  CHARACTER (8),
          2  TXT03L    FIXED BINARY (15,0),
          2  TXT03F    CHARACTER (1),
          2  DFHMS10 CHARACTER (4),
          2  TXT03I  CHARACTER (78),
          2  TXT04L    FIXED BINARY (15,0),
          2  TXT04F    CHARACTER (1),
          2  DFHMS11 CHARACTER (4),
          2  TXT04I  CHARACTER (72),
          2  TXT05L    FIXED BINARY (15,0),
          2  TXT05F    CHARACTER (1),
          2  DFHMS12 CHARACTER (4),
          2  TXT05I  CHARACTER (37),
          2  TXT06L    FIXED BINARY (15,0),
          2  TXT06F    CHARACTER (1),
          2  DFHMS13 CHARACTER (4),
          2  TXT06I  CHARACTER (13),
          2  USERIDL    FIXED BINARY (15,0),
          2  USERIDF    CHARACTER (1),
          2  DFHMS14 CHARACTER (4),
          2  USERIDI  CHARACTER (5),
          2  TXT07L    FIXED BINARY (15,0),
          2  TXT07F    CHARACTER (1),
          2  DFHMS15 CHARACTER (4),
          2  TXT07I  CHARACTER (13),
          2  PSWDL    FIXED BINARY (15,0),
          2  PSWDF    CHARACTER (1),
          2  DFHMS16 CHARACTER (4),
          2  PSWDI  CHARACTER (8),
          2  ERRMSGL    FIXED BINARY (15,0),
          2  ERRMSGF    CHARACTER (1),
          2  DFHMS17 CHARACTER (4),
          2  ERRMSGI  CHARACTER (75),
          2  TXT08L    FIXED BINARY (15,0),
          2  TXT08F    CHARACTER (1),
          2  DFHMS18 CHARACTER (4),
          2  TXT08I  CHARACTER (25),
          2  VERL    FIXED BINARY (15,0),
          2  VERF    CHARACTER (1),
          2  DFHMS19 CHARACTER (4),
          2  VERI  CHARACTER (7),
          2 FILL0112  CHARACTER (1);
     DECLARE 1 BANK10AO BASED(MAPAREA) UNALIGNED,
           2  DFHMS20 CHARACTER (12),
          2  DFHMS21 FIXED BINARY (15,0),
          2  TXT01A    CHARACTER (1),
          2  TXT01C    CHARACTER (1),
          2  TXT01P    CHARACTER (1),
          2  TXT01H    CHARACTER (1),
          2  TXT01V    CHARACTER (1),
          2  TXT01O  CHARACTER (5),
          2  DFHMS22 FIXED BINARY (15,0),
          2  SCRNA    CHARACTER (1),
          2  SCRNC    CHARACTER (1),
          2  SCRNP    CHARACTER (1),
          2  SCRNH    CHARACTER (1),
          2  SCRNV    CHARACTER (1),
          2  SCRNO  CHARACTER (6),
          2  DFHMS23 FIXED BINARY (15,0),
          2  HEAD1A    CHARACTER (1),
          2  HEAD1C    CHARACTER (1),
          2  HEAD1P    CHARACTER (1),
          2  HEAD1H    CHARACTER (1),
          2  HEAD1V    CHARACTER (1),
          2  HEAD1O  CHARACTER (50),
          2  DFHMS24 FIXED BINARY (15,0),
          2  DATEA    CHARACTER (1),
          2  DATEC    CHARACTER (1),
          2  DATEP    CHARACTER (1),
          2  DATEH    CHARACTER (1),
          2  DATEV    CHARACTER (1),
          2  DATEO  CHARACTER (11),
          2  DFHMS25 FIXED BINARY (15,0),
          2  TXT02A    CHARACTER (1),
          2  TXT02C    CHARACTER (1),
          2  TXT02P    CHARACTER (1),
          2  TXT02H    CHARACTER (1),
          2  TXT02V    CHARACTER (1),
          2  TXT02O  CHARACTER (5),
          2  DFHMS26 FIXED BINARY (15,0),
          2  TRANA    CHARACTER (1),
          2  TRANC    CHARACTER (1),
          2  TRANP    CHARACTER (1),
          2  TRANH    CHARACTER (1),
          2  TRANV    CHARACTER (1),
          2  TRANO  CHARACTER (4),
          2  DFHMS27 FIXED BINARY (15,0),
          2  HEAD2A    CHARACTER (1),
          2  HEAD2C    CHARACTER (1),
          2  HEAD2P    CHARACTER (1),
          2  HEAD2H    CHARACTER (1),
          2  HEAD2V    CHARACTER (1),
          2  HEAD2O  CHARACTER (50),
          2  DFHMS28 FIXED BINARY (15,0),
          2  TIMEA    CHARACTER (1),
          2  TIMEC    CHARACTER (1),
          2  TIMEP    CHARACTER (1),
          2  TIMEH    CHARACTER (1),
          2  TIMEV    CHARACTER (1),
          2  TIMEO  CHARACTER (8),
          2  DFHMS29 FIXED BINARY (15,0),
          2  TXT03A    CHARACTER (1),
          2  TXT03C    CHARACTER (1),
          2  TXT03P    CHARACTER (1),
          2  TXT03H    CHARACTER (1),
          2  TXT03V    CHARACTER (1),
          2  TXT03O  CHARACTER (78),
          2  DFHMS30 FIXED BINARY (15,0),
          2  TXT04A    CHARACTER (1),
          2  TXT04C    CHARACTER (1),
          2  TXT04P    CHARACTER (1),
          2  TXT04H    CHARACTER (1),
          2  TXT04V    CHARACTER (1),
          2  TXT04O  CHARACTER (72),
          2  DFHMS31 FIXED BINARY (15,0),
          2  TXT05A    CHARACTER (1),
          2  TXT05C    CHARACTER (1),
          2  TXT05P    CHARACTER (1),
          2  TXT05H    CHARACTER (1),
          2  TXT05V    CHARACTER (1),
          2  TXT05O  CHARACTER (37),
          2  DFHMS32 FIXED BINARY (15,0),
          2  TXT06A    CHARACTER (1),
          2  TXT06C    CHARACTER (1),
          2  TXT06P    CHARACTER (1),
          2  TXT06H    CHARACTER (1),
          2  TXT06V    CHARACTER (1),
          2  TXT06O  CHARACTER (13),
          2  DFHMS33 FIXED BINARY (15,0),
          2  USERIDA    CHARACTER (1),
          2  USERIDC    CHARACTER (1),
          2  USERIDP    CHARACTER (1),
          2  USERIDH    CHARACTER (1),
          2  USERIDV    CHARACTER (1),
          2  USERIDO  CHARACTER (5),
          2  DFHMS34 FIXED BINARY (15,0),
          2  TXT07A    CHARACTER (1),
          2  TXT07C    CHARACTER (1),
          2  TXT07P    CHARACTER (1),
          2  TXT07H    CHARACTER (1),
          2  TXT07V    CHARACTER (1),
          2  TXT07O  CHARACTER (13),
          2  DFHMS35 FIXED BINARY (15,0),
          2  PSWDA    CHARACTER (1),
          2  PSWDC    CHARACTER (1),
          2  PSWDP    CHARACTER (1),
          2  PSWDH    CHARACTER (1),
          2  PSWDV    CHARACTER (1),
          2  PSWDO  CHARACTER (8),
          2  DFHMS36 FIXED BINARY (15,0),
          2  ERRMSGA    CHARACTER (1),
          2  ERRMSGC    CHARACTER (1),
          2  ERRMSGP    CHARACTER (1),
          2  ERRMSGH    CHARACTER (1),
          2  ERRMSGV    CHARACTER (1),
          2  ERRMSGO  CHARACTER (75),
          2  DFHMS37 FIXED BINARY (15,0),
          2  TXT08A    CHARACTER (1),
          2  TXT08C    CHARACTER (1),
          2  TXT08P    CHARACTER (1),
          2  TXT08H    CHARACTER (1),
          2  TXT08V    CHARACTER (1),
          2  TXT08O  CHARACTER (25),
          2  DFHMS38 FIXED BINARY (15,0),
          2  VERA    CHARACTER (1),
          2  VERC    CHARACTER (1),
          2  VERP    CHARACTER (1),
          2  VERH    CHARACTER (1),
          2  VERV    CHARACTER (1),
          2  VERO  CHARACTER (7),
          2 FILL0112  CHARACTER (1);
    /* END OF MAP DEFINITION */
     DECLARE 1 HELP10AI BASED(MAPAREA) UNALIGNED,
          2  DFHMS39 CHARACTER (12),
          2  ATXT01L    FIXED BINARY (15,0),
          2  ATXT01F    CHARACTER (1),
          2  DFHMS40 CHARACTER (4),
          2  ATXT01I  CHARACTER (5),
          2  ASCRNL    FIXED BINARY (15,0),
          2  ASCRNF    CHARACTER (1),
          2  DFHMS41 CHARACTER (4),
          2  ASCRNI  CHARACTER (6),
          2  AHEAD1L    FIXED BINARY (15,0),
          2  AHEAD1F    CHARACTER (1),
          2  DFHMS42 CHARACTER (4),
          2  AHEAD1I  CHARACTER (50),
          2  ADATEL    FIXED BINARY (15,0),
          2  ADATEF    CHARACTER (1),
          2  DFHMS43 CHARACTER (4),
          2  ADATEI  CHARACTER (11),
          2  ATXT02L    FIXED BINARY (15,0),
          2  ATXT02F    CHARACTER (1),
          2  DFHMS44 CHARACTER (4),
          2  ATXT02I  CHARACTER (5),
          2  ATRANL    FIXED BINARY (15,0),
          2  ATRANF    CHARACTER (1),
          2  DFHMS45 CHARACTER (4),
          2  ATRANI  CHARACTER (4),
          2  AHEAD2L    FIXED BINARY (15,0),
          2  AHEAD2F    CHARACTER (1),
          2  DFHMS46 CHARACTER (4),
          2  AHEAD2I  CHARACTER (50),
          2  ATIMEL    FIXED BINARY (15,0),
          2  ATIMEF    CHARACTER (1),
          2  DFHMS47 CHARACTER (4),
          2  ATIMEI  CHARACTER (8),
          2  AHLP01L    FIXED BINARY (15,0),
          2  AHLP01F    CHARACTER (1),
          2  DFHMS48 CHARACTER (4),
          2  AHLP01I  CHARACTER (75),
          2  AHLP02L    FIXED BINARY (15,0),
          2  AHLP02F    CHARACTER (1),
          2  DFHMS49 CHARACTER (4),
          2  AHLP02I  CHARACTER (75),
          2  AHLP03L    FIXED BINARY (15,0),
          2  AHLP03F    CHARACTER (1),
          2  DFHMS50 CHARACTER (4),
          2  AHLP03I  CHARACTER (75),
          2  AHLP04L    FIXED BINARY (15,0),
          2  AHLP04F    CHARACTER (1),
          2  DFHMS51 CHARACTER (4),
          2  AHLP04I  CHARACTER (75),
          2  AHLP05L    FIXED BINARY (15,0),
          2  AHLP05F    CHARACTER (1),
          2  DFHMS52 CHARACTER (4),
          2  AHLP05I  CHARACTER (75),
          2  AHLP06L    FIXED BINARY (15,0),
          2  AHLP06F    CHARACTER (1),
          2  DFHMS53 CHARACTER (4),
          2  AHLP06I  CHARACTER (75),
          2  AHLP07L    FIXED BINARY (15,0),
          2  AHLP07F    CHARACTER (1),
          2  DFHMS54 CHARACTER (4),
          2  AHLP07I  CHARACTER (75),
          2  AHLP08L    FIXED BINARY (15,0),
          2  AHLP08F    CHARACTER (1),
          2  DFHMS55 CHARACTER (4),
          2  AHLP08I  CHARACTER (75),
          2  AHLP09L    FIXED BINARY (15,0),
          2  AHLP09F    CHARACTER (1),
          2  DFHMS56 CHARACTER (4),
          2  AHLP09I  CHARACTER (75),
          2  AHLP10L    FIXED BINARY (15,0),
          2  AHLP10F    CHARACTER (1),
          2  DFHMS57 CHARACTER (4),
          2  AHLP10I  CHARACTER (75),
          2  AHLP11L    FIXED BINARY (15,0),
          2  AHLP11F    CHARACTER (1),
          2  DFHMS58 CHARACTER (4),
          2  AHLP11I  CHARACTER (75),
          2  AHLP12L    FIXED BINARY (15,0),
          2  AHLP12F    CHARACTER (1),
          2  DFHMS59 CHARACTER (4),
          2  AHLP12I  CHARACTER (75),
          2  AHLP13L    FIXED BINARY (15,0),
          2  AHLP13F    CHARACTER (1),
          2  DFHMS60 CHARACTER (4),
          2  AHLP13I  CHARACTER (75),
          2  AHLP14L    FIXED BINARY (15,0),
          2  AHLP14F    CHARACTER (1),
          2  DFHMS61 CHARACTER (4),
          2  AHLP14I  CHARACTER (75),
          2  AHLP15L    FIXED BINARY (15,0),
          2  AHLP15F    CHARACTER (1),
          2  DFHMS62 CHARACTER (4),
          2  AHLP15I  CHARACTER (75),
          2  AHLP16L    FIXED BINARY (15,0),
          2  AHLP16F    CHARACTER (1),
          2  DFHMS63 CHARACTER (4),
          2  AHLP16I  CHARACTER (75),
          2  AHLP17L    FIXED BINARY (15,0),
          2  AHLP17F    CHARACTER (1),
          2  DFHMS64 CHARACTER (4),
          2  AHLP17I  CHARACTER (75),
          2  AHLP18L    FIXED BINARY (15,0),
          2  AHLP18F    CHARACTER (1),
          2  DFHMS65 CHARACTER (4),
          2  AHLP18I  CHARACTER (75),
          2  AHLP19L    FIXED BINARY (15,0),
          2  AHLP19F    CHARACTER (1),
          2  DFHMS66 CHARACTER (4),
          2  AHLP19I  CHARACTER (75),
          2  ATXT03L    FIXED BINARY (15,0),
          2  ATXT03F    CHARACTER (1),
          2  DFHMS67 CHARACTER (4),
          2  ATXT03I  CHARACTER (28),
          2  AVERL    FIXED BINARY (15,0),
          2  AVERF    CHARACTER (1),
          2  DFHMS68 CHARACTER (4),
          2  AVERI  CHARACTER (7),
          2 FILL0263  CHARACTER (1);
     DECLARE 1 HELP10AO BASED(MAPAREA) UNALIGNED,
           2  DFHMS69 CHARACTER (12),
          2  DFHMS70 FIXED BINARY (15,0),
          2  ATXT01A    CHARACTER (1),
          2  ATXT01C    CHARACTER (1),
          2  ATXT01P    CHARACTER (1),
          2  ATXT01H    CHARACTER (1),
          2  ATXT01V    CHARACTER (1),
          2  ATXT01O  CHARACTER (5),
          2  DFHMS71 FIXED BINARY (15,0),
          2  ASCRNA    CHARACTER (1),
          2  ASCRNC    CHARACTER (1),
          2  ASCRNP    CHARACTER (1),
          2  ASCRNH    CHARACTER (1),
          2  ASCRNV    CHARACTER (1),
          2  ASCRNO  CHARACTER (6),
          2  DFHMS72 FIXED BINARY (15,0),
          2  AHEAD1A    CHARACTER (1),
          2  AHEAD1C    CHARACTER (1),
          2  AHEAD1P    CHARACTER (1),
          2  AHEAD1H    CHARACTER (1),
          2  AHEAD1V    CHARACTER (1),
          2  AHEAD1O  CHARACTER (50),
          2  DFHMS73 FIXED BINARY (15,0),
          2  ADATEA    CHARACTER (1),
          2  ADATEC    CHARACTER (1),
          2  ADATEP    CHARACTER (1),
          2  ADATEH    CHARACTER (1),
          2  ADATEV    CHARACTER (1),
          2  ADATEO  CHARACTER (11),
          2  DFHMS74 FIXED BINARY (15,0),
          2  ATXT02A    CHARACTER (1),
          2  ATXT02C    CHARACTER (1),
          2  ATXT02P    CHARACTER (1),
          2  ATXT02H    CHARACTER (1),
          2  ATXT02V    CHARACTER (1),
          2  ATXT02O  CHARACTER (5),
          2  DFHMS75 FIXED BINARY (15,0),
          2  ATRANA    CHARACTER (1),
          2  ATRANC    CHARACTER (1),
          2  ATRANP    CHARACTER (1),
          2  ATRANH    CHARACTER (1),
          2  ATRANV    CHARACTER (1),
          2  ATRANO  CHARACTER (4),
          2  DFHMS76 FIXED BINARY (15,0),
          2  AHEAD2A    CHARACTER (1),
          2  AHEAD2C    CHARACTER (1),
          2  AHEAD2P    CHARACTER (1),
          2  AHEAD2H    CHARACTER (1),
          2  AHEAD2V    CHARACTER (1),
          2  AHEAD2O  CHARACTER (50),
          2  DFHMS77 FIXED BINARY (15,0),
          2  ATIMEA    CHARACTER (1),
          2  ATIMEC    CHARACTER (1),
          2  ATIMEP    CHARACTER (1),
          2  ATIMEH    CHARACTER (1),
          2  ATIMEV    CHARACTER (1),
          2  ATIMEO  CHARACTER (8),
          2  DFHMS78 FIXED BINARY (15,0),
          2  AHLP01A    CHARACTER (1),
          2  AHLP01C    CHARACTER (1),
          2  AHLP01P    CHARACTER (1),
          2  AHLP01H    CHARACTER (1),
          2  AHLP01V    CHARACTER (1),
          2  AHLP01O  CHARACTER (75),
          2  DFHMS79 FIXED BINARY (15,0),
          2  AHLP02A    CHARACTER (1),
          2  AHLP02C    CHARACTER (1),
          2  AHLP02P    CHARACTER (1),
          2  AHLP02H    CHARACTER (1),
          2  AHLP02V    CHARACTER (1),
          2  AHLP02O  CHARACTER (75),
          2  DFHMS80 FIXED BINARY (15,0),
          2  AHLP03A    CHARACTER (1),
          2  AHLP03C    CHARACTER (1),
          2  AHLP03P    CHARACTER (1),
          2  AHLP03H    CHARACTER (1),
          2  AHLP03V    CHARACTER (1),
          2  AHLP03O  CHARACTER (75),
          2  DFHMS81 FIXED BINARY (15,0),
          2  AHLP04A    CHARACTER (1),
          2  AHLP04C    CHARACTER (1),
          2  AHLP04P    CHARACTER (1),
          2  AHLP04H    CHARACTER (1),
          2  AHLP04V    CHARACTER (1),
          2  AHLP04O  CHARACTER (75),
          2  DFHMS82 FIXED BINARY (15,0),
          2  AHLP05A    CHARACTER (1),
          2  AHLP05C    CHARACTER (1),
          2  AHLP05P    CHARACTER (1),
          2  AHLP05H    CHARACTER (1),
          2  AHLP05V    CHARACTER (1),
          2  AHLP05O  CHARACTER (75),
          2  DFHMS83 FIXED BINARY (15,0),
          2  AHLP06A    CHARACTER (1),
          2  AHLP06C    CHARACTER (1),
          2  AHLP06P    CHARACTER (1),
          2  AHLP06H    CHARACTER (1),
          2  AHLP06V    CHARACTER (1),
          2  AHLP06O  CHARACTER (75),
          2  DFHMS84 FIXED BINARY (15,0),
          2  AHLP07A    CHARACTER (1),
          2  AHLP07C    CHARACTER (1),
          2  AHLP07P    CHARACTER (1),
          2  AHLP07H    CHARACTER (1),
          2  AHLP07V    CHARACTER (1),
          2  AHLP07O  CHARACTER (75),
          2  DFHMS85 FIXED BINARY (15,0),
          2  AHLP08A    CHARACTER (1),
          2  AHLP08C    CHARACTER (1),
          2  AHLP08P    CHARACTER (1),
          2  AHLP08H    CHARACTER (1),
          2  AHLP08V    CHARACTER (1),
          2  AHLP08O  CHARACTER (75),
          2  DFHMS86 FIXED BINARY (15,0),
          2  AHLP09A    CHARACTER (1),
          2  AHLP09C    CHARACTER (1),
          2  AHLP09P    CHARACTER (1),
          2  AHLP09H    CHARACTER (1),
          2  AHLP09V    CHARACTER (1),
          2  AHLP09O  CHARACTER (75),
          2  DFHMS87 FIXED BINARY (15,0),
          2  AHLP10A    CHARACTER (1),
          2  AHLP10C    CHARACTER (1),
          2  AHLP10P    CHARACTER (1),
          2  AHLP10H    CHARACTER (1),
          2  AHLP10V    CHARACTER (1),
          2  AHLP10O  CHARACTER (75),
          2  DFHMS88 FIXED BINARY (15,0),
          2  AHLP11A    CHARACTER (1),
          2  AHLP11C    CHARACTER (1),
          2  AHLP11P    CHARACTER (1),
          2  AHLP11H    CHARACTER (1),
          2  AHLP11V    CHARACTER (1),
          2  AHLP11O  CHARACTER (75),
          2  DFHMS89 FIXED BINARY (15,0),
          2  AHLP12A    CHARACTER (1),
          2  AHLP12C    CHARACTER (1),
          2  AHLP12P    CHARACTER (1),
          2  AHLP12H    CHARACTER (1),
          2  AHLP12V    CHARACTER (1),
          2  AHLP12O  CHARACTER (75),
          2  DFHMS90 FIXED BINARY (15,0),
          2  AHLP13A    CHARACTER (1),
          2  AHLP13C    CHARACTER (1),
          2  AHLP13P    CHARACTER (1),
          2  AHLP13H    CHARACTER (1),
          2  AHLP13V    CHARACTER (1),
          2  AHLP13O  CHARACTER (75),
          2  DFHMS91 FIXED BINARY (15,0),
          2  AHLP14A    CHARACTER (1),
          2  AHLP14C    CHARACTER (1),
          2  AHLP14P    CHARACTER (1),
          2  AHLP14H    CHARACTER (1),
          2  AHLP14V    CHARACTER (1),
          2  AHLP14O  CHARACTER (75),
          2  DFHMS92 FIXED BINARY (15,0),
          2  AHLP15A    CHARACTER (1),
          2  AHLP15C    CHARACTER (1),
          2  AHLP15P    CHARACTER (1),
          2  AHLP15H    CHARACTER (1),
          2  AHLP15V    CHARACTER (1),
          2  AHLP15O  CHARACTER (75),
          2  DFHMS93 FIXED BINARY (15,0),
          2  AHLP16A    CHARACTER (1),
          2  AHLP16C    CHARACTER (1),
          2  AHLP16P    CHARACTER (1),
          2  AHLP16H    CHARACTER (1),
          2  AHLP16V    CHARACTER (1),
          2  AHLP16O  CHARACTER (75),
          2  DFHMS94 FIXED BINARY (15,0),
          2  AHLP17A    CHARACTER (1),
          2  AHLP17C    CHARACTER (1),
          2  AHLP17P    CHARACTER (1),
          2  AHLP17H    CHARACTER (1),
          2  AHLP17V    CHARACTER (1),
          2  AHLP17O  CHARACTER (75),
          2  DFHMS95 FIXED BINARY (15,0),
          2  AHLP18A    CHARACTER (1),
          2  AHLP18C    CHARACTER (1),
          2  AHLP18P    CHARACTER (1),
          2  AHLP18H    CHARACTER (1),
          2  AHLP18V    CHARACTER (1),
          2  AHLP18O  CHARACTER (75),
          2  DFHMS96 FIXED BINARY (15,0),
          2  AHLP19A    CHARACTER (1),
          2  AHLP19C    CHARACTER (1),
          2  AHLP19P    CHARACTER (1),
          2  AHLP19H    CHARACTER (1),
          2  AHLP19V    CHARACTER (1),
          2  AHLP19O  CHARACTER (75),
          2  DFHMS97 FIXED BINARY (15,0),
          2  ATXT03A    CHARACTER (1),
          2  ATXT03C    CHARACTER (1),
          2  ATXT03P    CHARACTER (1),
          2  ATXT03H    CHARACTER (1),
          2  ATXT03V    CHARACTER (1),
          2  ATXT03O  CHARACTER (28),
          2  DFHMS98 FIXED BINARY (15,0),
          2  AVERA    CHARACTER (1),
          2  AVERC    CHARACTER (1),
          2  AVERP    CHARACTER (1),
          2  AVERH    CHARACTER (1),
          2  AVERV    CHARACTER (1),
          2  AVERO  CHARACTER (7),
          2 FILL0263  CHARACTER (1);
    /* END OF MAP DEFINITION */
